import { ReactComponent as SkillsIcon } from "../../assets/icon/skills-icon.svg";
import { ReactComponent as InitiativeIcon } from "../../assets/icon/initiative-icon.svg";
import { ReactComponent as MotivationIcon } from "../../assets/icon/motivation-icon.svg";
import { ReactComponent as QualityIcon } from "../../assets/icon/quality-icon.svg";
import { ReactComponent as PurposefulnessIcon } from "../../assets/icon/purposefulness-icon.svg";
import { ReactComponent as CommunicationIcon } from "../../assets/icon/communication-icon.svg";

const swiperItemData = [
    {
      id: 1,
      image: SkillsIcon,
      title: "відточині навички",
      description: `Я постійно вдосконалюю свої навички та знання, щоб забезпечити
      найкращий результат для клієнта. Я володію глибоким розумінням HTML,
      CSS, JavaScript, а також використовую бібліотеки та фреймворки, такі
      як React.js. Мої навички дозволяють мені створювати веб-сайти, які
      працюють ефективно та мають чудовий дизайн.`,
    },
    {
        id: 2,
        image: InitiativeIcon,
        title: "ініциативність",
        description: `Я завжди готовий до нових викликів та ініціативно пропоную свої ідеї
        щодо поліпшення проекту. Я вмію думати креативно та швидко знаходжу
        рішення для будь-яких проблем, які можуть виникнути під час
        розробки. Моя ініціативність дозволяє мені досягати найкращих
        результатів для клієнта.`,
      },
      {
        id: 3,
        image: MotivationIcon,
        title: "мотивація",
        description: `Я завжди мотивований досягати нових результатів, бути у ногу з
        тенденціями та вдосконалювати свої професійні навички. Я люблю свою
        роботу та дуже ціную можливість створювати щось нове, корисне та
        інноваційне. Моя мотивація дозволяє мені працювати на високому рівні
        та забезпечувати клієнту якісний результат.`,
      },
      {
        id: 4,
        image: QualityIcon,
        title: "висока якість",
        description: `Я завжди ставлю якість на перше місце в своїй роботі. Я використовую
        найкращі практики та технології, щоб забезпечити оптимальну
        продуктивність та ефективність проекту. Я також дотримуюся
        стандартів безпеки та захисту даних користувачів, щоб забезпечити
        безпеку та конфіденційність даних.`,
      },
      {
        id: 5,
        image: PurposefulnessIcon,
        title: "комунікабельність",
        description: `Я завжди дотримуюся професійної етики та виконую свої обов'язки з
        відповідальністю та чесністю. Я розумію важливість довіри, який
        клієнт покладає на мене, тому завжди дотримуюся угод та зобов'язань.
        Я також дотримуюся стандартів якості та безпеки, щоб забезпечити
        успішне завершення проекту та задоволення клієнта.`,
      },
      {
        id: 6,
        image: CommunicationIcon,
        title: "цілеспрямованість",
        description: `Я завжди працюю з метою досягнення бажаного результату. Я вмію
        планувати свою роботу та використовую найкращі методики управління
        проектами, щоб забезпечити успішне завершення проекту в строк. Моя
        цілеспрямованість дозволяє мені досягати найкращих результатів та
        задоволення від роботи з клієнтом.`,
      },
  ];
  
  export default swiperItemData;
  // swiper item(slide)
  